IdeaRS.Connections
AnchoringDataHelper.CreateRegionForAnchoring Method
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateRegionForAnchoring(IdeaRS.Connections.IAnchoring,System.Windows.Rect@,System.Windows.Media.Media3D.Point3D,IdeaRS.Connections.Model.IPlate)"]
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static IRegion2D CreateRegionForAnchoring(
	IAnchoring anchoring,
	ref Rect contactBoundBox,
	Point3D point,
	IPlate plate
)
Parameters
anchoring
Type: IAnchoring
[Missing <param name="anchoring"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateRegionForAnchoring(IdeaRS.Connections.IAnchoring,System.Windows.Rect@,System.Windows.Media.Media3D.Point3D,IdeaRS.Connections.Model.IPlate)"]
contactBoundBox
Type: Rect
[Missing <param name="contactBoundBox"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateRegionForAnchoring(IdeaRS.Connections.IAnchoring,System.Windows.Rect@,System.Windows.Media.Media3D.Point3D,IdeaRS.Connections.Model.IPlate)"]
point
Type: Point3D
[Missing <param name="point"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateRegionForAnchoring(IdeaRS.Connections.IAnchoring,System.Windows.Rect@,System.Windows.Media.Media3D.Point3D,IdeaRS.Connections.Model.IPlate)"]
plate
Type: IPlate
[Missing <param name="plate"/> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateRegionForAnchoring(IdeaRS.Connections.IAnchoring,System.Windows.Rect@,System.Windows.Media.Media3D.Point3D,IdeaRS.Connections.Model.IPlate)"]
Return Value
Type: IRegion2D
[Missing <returns> documentation for "M:IdeaRS.Connections.Data.AnchoringDataHelper.CreateRegionForAnchoring(IdeaRS.Connections.IAnchoring,System.Windows.Rect@,System.Windows.Media.Media3D.Point3D,IdeaRS.Connections.Model.IPlate)"]
See Also
Reference
AnchoringDataHelper Class
IdeaRS.Connections.Data Namespace